[Survived] GreaterThanOrEqualToNegotiation
FilterClass.php:25:5
 		return array_filter(
 			$collection,
 			function ( User $item ): bool {
-				return $item->getAge() >= $this->age;
+				return $item->getAge() < $this->age;
 			}
 		);

[Survived] GreaterThanOrEqualTo
FilterClass.php:25:5
 		return array_filter(
 			$collection,
 			function ( User $item ): bool {
-				return $item->getAge() >= $this->age;
+				return $item->getAge() > $this->age;
 			}
 		);
