[Killed] PublicVisibility
User.php:13:2
 		$this->age = $age;
 	}
 
-	public static function withAge( int $age ): self {
+	protected static function withAge(int $age) : self
 		$user = new User( $age );
 		return $user;
killedBy: Gin0115\Infection_Test\Tests\TestFilterClass::testFilterWithDefaultAge
statusReason: 1) Gin0115\Infection_Test\Tests\TestFilterClass::testFilterWithDefaultAge
Error: Call to protected method Gin0115\Infection_Test\User::withAge() from context 'Gin0115\Infection_Test\Tests\TestFilterClass'

/shared/httpd/php/htdocs/infection-cli-test/tests/TestFilterClass.php:16
phpvfscomposer:///shared/httpd/php/htdocs/infection-cli-test/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Asserti

[Killed] PublicVisibility
User.php:18:2
 		return $user;
 	}
 
-	public function getAge(): int {
+	protected function getAge() : int
 		return $this->age;
 	}
killedBy: Gin0115\Infection_Test\Tests\TestFilterClass::testFilterWithDefaultAge
statusReason: 1) Gin0115\Infection_Test\Tests\TestFilterClass::testFilterWithDefaultAge
Error: Call to protected method Gin0115\Infection_Test\User::getAge() from context 'Gin0115\Infection_Test\FilterClass'

/shared/httpd/php/htdocs/infection-cli-test/src/FilterClass.php:25
/shared/httpd/php/htdocs/infection-cli-test/src/FilterClass.php:26
/shared/httpd/php/htdocs/infection-cli-test/tests/TestFilterClass.php:2
